       IDENTIFICATION DIVISION.
       PROGRAM-ID. "course".
       AUTHOR.     FRNC-ABADE
       
       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
       0100-START-HERE.
           DISPLAY "Hello-world".
           STOP RUN.
       END PROGRAM course.    
    
