           IDENTIFICATION DIVISION.
           program-id. olamundo.
           procedure DIVISION.
             DISPLAY "Olá, Mundo!".
             STOP RUN.
